node {
  name: "images"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 3072
        }
      }
    }
  }
}
node {
  name: "image-labels"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Layer1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\014\000\000x\000\000\000"
      }
    }
  }
}
node {
  name: "Layer1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Layer1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.018042195588350296
      }
    }
  }
}
node {
  name: "Layer1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Layer1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Layer1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "Layer1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "Layer1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
}
node {
  name: "Layer1/weights/Initializer/truncated_normal"
  op: "Add"
  input: "Layer1/weights/Initializer/truncated_normal/mul"
  input: "Layer1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
}
node {
  name: "Layer1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3072
        }
        dim {
          size: 120
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer1/weights/Assign"
  op: "Assign"
  input: "Layer1/weights"
  input: "Layer1/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer1/weights/read"
  op: "Identity"
  input: "Layer1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
}
node {
  name: "Layer1/weights/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer1/weights/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "Layer1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
}
node {
  name: "Layer1/weights/Regularizer/l2_regularizer"
  op: "Mul"
  input: "Layer1/weights/Regularizer/l2_regularizer/scale"
  input: "Layer1/weights/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
}
node {
  name: "Layer1/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 120
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Layer1/biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 120
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer1/biases/Assign"
  op: "Assign"
  input: "Layer1/biases"
  input: "Layer1/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer1/biases/read"
  op: "Identity"
  input: "Layer1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/biases"
      }
    }
  }
}
node {
  name: "Layer1/MatMul"
  op: "MatMul"
  input: "images"
  input: "Layer1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Layer1/add"
  op: "Add"
  input: "Layer1/MatMul"
  input: "Layer1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer1/Relu"
  op: "Relu"
  input: "Layer1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer2/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "x\000\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "Layer2/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Layer2/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09128709137439728
      }
    }
  }
}
node {
  name: "Layer2/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Layer2/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Layer2/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "Layer2/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "Layer2/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
}
node {
  name: "Layer2/weights/Initializer/truncated_normal"
  op: "Add"
  input: "Layer2/weights/Initializer/truncated_normal/mul"
  input: "Layer2/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
}
node {
  name: "Layer2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 120
        }
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer2/weights/Assign"
  op: "Assign"
  input: "Layer2/weights"
  input: "Layer2/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer2/weights/read"
  op: "Identity"
  input: "Layer2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
}
node {
  name: "Layer2/weights/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer2/weights/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "Layer2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
}
node {
  name: "Layer2/weights/Regularizer/l2_regularizer"
  op: "Mul"
  input: "Layer2/weights/Regularizer/l2_regularizer/scale"
  input: "Layer2/weights/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
}
node {
  name: "Layer2/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 10
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Layer2/biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer2/biases/Assign"
  op: "Assign"
  input: "Layer2/biases"
  input: "Layer2/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer2/biases/read"
  op: "Identity"
  input: "Layer2/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/biases"
      }
    }
  }
}
node {
  name: "Layer2/MatMul"
  op: "MatMul"
  input: "Layer1/Relu"
  input: "Layer2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Layer2/add"
  op: "Add"
  input: "Layer2/MatMul"
  input: "Layer2/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "logits/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "logits"
      }
    }
  }
}
node {
  name: "logits"
  op: "HistogramSummary"
  input: "logits/tag"
  input: "Layer2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Loss/cross_entropy/Shape"
  op: "Shape"
  input: "image-labels"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss/cross_entropy/cross_entropy"
  op: "SparseSoftmaxCrossEntropyWithLogits"
  input: "Layer2/add"
  input: "image-labels"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlabels"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "Loss/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Loss/Mean"
  op: "Mean"
  input: "Loss/cross_entropy/cross_entropy"
  input: "Loss/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Loss/AddN"
  op: "AddN"
  input: "Layer1/weights/Regularizer/l2_regularizer"
  input: "Layer2/weights/Regularizer/l2_regularizer"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Loss/add"
  op: "Add"
  input: "Loss/Mean"
  input: "Loss/AddN"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Loss/loss/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Loss/loss"
      }
    }
  }
}
node {
  name: "Loss/loss"
  op: "ScalarSummary"
  input: "Loss/loss/tags"
  input: "Loss/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
}
node {
  name: "gradients/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gradients/Fill"
  op: "Fill"
  input: "gradients/Shape"
  input: "gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Loss/add_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Loss/add_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Loss/add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/Loss/add_grad/Shape"
  input: "gradients/Loss/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/add_grad/Sum"
  op: "Sum"
  input: "gradients/Fill"
  input: "gradients/Loss/add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Loss/add_grad/Reshape"
  op: "Reshape"
  input: "gradients/Loss/add_grad/Sum"
  input: "gradients/Loss/add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/add_grad/Sum_1"
  op: "Sum"
  input: "gradients/Fill"
  input: "gradients/Loss/add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Loss/add_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/Loss/add_grad/Sum_1"
  input: "gradients/Loss/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Loss/add_grad/Reshape"
  input: "^gradients/Loss/add_grad/Reshape_1"
}
node {
  name: "gradients/Loss/add_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Loss/add_grad/Reshape"
  input: "^gradients/Loss/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Loss/add_grad/Reshape"
      }
    }
  }
}
node {
  name: "gradients/Loss/add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Loss/add_grad/Reshape_1"
  input: "^gradients/Loss/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Loss/add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Reshape"
  op: "Reshape"
  input: "gradients/Loss/add_grad/tuple/control_dependency"
  input: "gradients/Loss/Mean_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Shape"
  op: "Shape"
  input: "Loss/cross_entropy/cross_entropy"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Tile"
  op: "Tile"
  input: "gradients/Loss/Mean_grad/Reshape"
  input: "gradients/Loss/Mean_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Shape_1"
  op: "Shape"
  input: "Loss/cross_entropy/cross_entropy"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Shape_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Prod"
  op: "Prod"
  input: "gradients/Loss/Mean_grad/Shape_1"
  input: "gradients/Loss/Mean_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Prod_1"
  op: "Prod"
  input: "gradients/Loss/Mean_grad/Shape_2"
  input: "gradients/Loss/Mean_grad/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Maximum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Maximum"
  op: "Maximum"
  input: "gradients/Loss/Mean_grad/Prod_1"
  input: "gradients/Loss/Mean_grad/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/floordiv"
  op: "FloorDiv"
  input: "gradients/Loss/Mean_grad/Prod"
  input: "gradients/Loss/Mean_grad/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/Cast"
  op: "Cast"
  input: "gradients/Loss/Mean_grad/floordiv"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/Mean_grad/truediv"
  op: "RealDiv"
  input: "gradients/Loss/Mean_grad/Tile"
  input: "gradients/Loss/Mean_grad/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Loss/AddN_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Loss/add_grad/tuple/control_dependency_1"
}
node {
  name: "gradients/Loss/AddN_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Loss/add_grad/tuple/control_dependency_1"
  input: "^gradients/Loss/AddN_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Loss/add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/Loss/AddN_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Loss/add_grad/tuple/control_dependency_1"
  input: "^gradients/Loss/AddN_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Loss/add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/zeros_like"
  op: "ZerosLike"
  input: "Loss/cross_entropy/cross_entropy:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Loss/cross_entropy/cross_entropy_grad/PreventGradient"
  op: "PreventGradient"
  input: "Loss/cross_entropy/cross_entropy:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "message"
    value {
      s: "Currently there is no way to take the second derivative of sparse_softmax_cross_entropy_with_logits due to the fused implementation\'s interaction with tf.gradients()"
    }
  }
}
node {
  name: "gradients/Loss/cross_entropy/cross_entropy_grad/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "gradients/Loss/cross_entropy/cross_entropy_grad/ExpandDims"
  op: "ExpandDims"
  input: "gradients/Loss/Mean_grad/truediv"
  input: "gradients/Loss/cross_entropy/cross_entropy_grad/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Loss/cross_entropy/cross_entropy_grad/mul"
  op: "Mul"
  input: "gradients/Loss/cross_entropy/cross_entropy_grad/ExpandDims"
  input: "gradients/Loss/cross_entropy/cross_entropy_grad/PreventGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Shape"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/mul"
  op: "Mul"
  input: "gradients/Loss/AddN_grad/tuple/control_dependency"
  input: "Layer1/weights/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Sum"
  op: "Sum"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/mul"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape"
  op: "Reshape"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Sum"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/mul_1"
  op: "Mul"
  input: "Layer1/weights/Regularizer/l2_regularizer/scale"
  input: "gradients/Loss/AddN_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Sum_1"
  op: "Sum"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/mul_1"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Sum_1"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape"
  input: "^gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape_1"
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape"
  input: "^gradients/Layer1/weights/Regularizer/l2_regularizer_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape"
      }
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape_1"
  input: "^gradients/Layer1/weights/Regularizer/l2_regularizer_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer1/weights/Regularizer/l2_regularizer_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Shape"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/mul"
  op: "Mul"
  input: "gradients/Loss/AddN_grad/tuple/control_dependency_1"
  input: "Layer2/weights/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Sum"
  op: "Sum"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/mul"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape"
  op: "Reshape"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Sum"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/mul_1"
  op: "Mul"
  input: "Layer2/weights/Regularizer/l2_regularizer/scale"
  input: "gradients/Loss/AddN_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Sum_1"
  op: "Sum"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/mul_1"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Sum_1"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape"
  input: "^gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape_1"
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape"
  input: "^gradients/Layer2/weights/Regularizer/l2_regularizer_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape"
      }
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape_1"
  input: "^gradients/Layer2/weights/Regularizer/l2_regularizer_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer2/weights/Regularizer/l2_regularizer_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/Shape"
  op: "Shape"
  input: "Layer2/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/Layer2/add_grad/Shape"
  input: "gradients/Layer2/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/Sum"
  op: "Sum"
  input: "gradients/Loss/cross_entropy/cross_entropy_grad/mul"
  input: "gradients/Layer2/add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/Reshape"
  op: "Reshape"
  input: "gradients/Layer2/add_grad/Sum"
  input: "gradients/Layer2/add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/Sum_1"
  op: "Sum"
  input: "gradients/Loss/cross_entropy/cross_entropy_grad/mul"
  input: "gradients/Layer2/add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/Layer2/add_grad/Sum_1"
  input: "gradients/Layer2/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Layer2/add_grad/Reshape"
  input: "^gradients/Layer2/add_grad/Reshape_1"
}
node {
  name: "gradients/Layer2/add_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Layer2/add_grad/Reshape"
  input: "^gradients/Layer2/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer2/add_grad/Reshape"
      }
    }
  }
}
node {
  name: "gradients/Layer2/add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Layer2/add_grad/Reshape_1"
  input: "^gradients/Layer2/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer2/add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/Layer1/weights/Regularizer/l2_regularizer/L2Loss_grad/mul"
  op: "Mul"
  input: "Layer1/weights/read"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Layer2/weights/Regularizer/l2_regularizer/L2Loss_grad/mul"
  op: "Mul"
  input: "Layer2/weights/read"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Layer2/MatMul_grad/MatMul"
  op: "MatMul"
  input: "gradients/Layer2/add_grad/tuple/control_dependency"
  input: "Layer2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "gradients/Layer2/MatMul_grad/MatMul_1"
  op: "MatMul"
  input: "Layer1/Relu"
  input: "gradients/Layer2/add_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer2/MatMul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Layer2/MatMul_grad/MatMul"
  input: "^gradients/Layer2/MatMul_grad/MatMul_1"
}
node {
  name: "gradients/Layer2/MatMul_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Layer2/MatMul_grad/MatMul"
  input: "^gradients/Layer2/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer2/MatMul_grad/MatMul"
      }
    }
  }
}
node {
  name: "gradients/Layer2/MatMul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Layer2/MatMul_grad/MatMul_1"
  input: "^gradients/Layer2/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer2/MatMul_grad/MatMul_1"
      }
    }
  }
}
node {
  name: "gradients/Layer1/Relu_grad/ReluGrad"
  op: "ReluGrad"
  input: "gradients/Layer2/MatMul_grad/tuple/control_dependency"
  input: "Layer1/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/AddN"
  op: "AddN"
  input: "gradients/Layer2/weights/Regularizer/l2_regularizer/L2Loss_grad/mul"
  input: "gradients/Layer2/MatMul_grad/tuple/control_dependency_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer2/weights/Regularizer/l2_regularizer/L2Loss_grad/mul"
      }
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/Shape"
  op: "Shape"
  input: "Layer1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 120
      }
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/Layer1/add_grad/Shape"
  input: "gradients/Layer1/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/Sum"
  op: "Sum"
  input: "gradients/Layer1/Relu_grad/ReluGrad"
  input: "gradients/Layer1/add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/Reshape"
  op: "Reshape"
  input: "gradients/Layer1/add_grad/Sum"
  input: "gradients/Layer1/add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/Sum_1"
  op: "Sum"
  input: "gradients/Layer1/Relu_grad/ReluGrad"
  input: "gradients/Layer1/add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/Layer1/add_grad/Sum_1"
  input: "gradients/Layer1/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Layer1/add_grad/Reshape"
  input: "^gradients/Layer1/add_grad/Reshape_1"
}
node {
  name: "gradients/Layer1/add_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Layer1/add_grad/Reshape"
  input: "^gradients/Layer1/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer1/add_grad/Reshape"
      }
    }
  }
}
node {
  name: "gradients/Layer1/add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Layer1/add_grad/Reshape_1"
  input: "^gradients/Layer1/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer1/add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/Layer1/MatMul_grad/MatMul"
  op: "MatMul"
  input: "gradients/Layer1/add_grad/tuple/control_dependency"
  input: "Layer1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "gradients/Layer1/MatMul_grad/MatMul_1"
  op: "MatMul"
  input: "images"
  input: "gradients/Layer1/add_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/Layer1/MatMul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/Layer1/MatMul_grad/MatMul"
  input: "^gradients/Layer1/MatMul_grad/MatMul_1"
}
node {
  name: "gradients/Layer1/MatMul_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/Layer1/MatMul_grad/MatMul"
  input: "^gradients/Layer1/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer1/MatMul_grad/MatMul"
      }
    }
  }
}
node {
  name: "gradients/Layer1/MatMul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/Layer1/MatMul_grad/MatMul_1"
  input: "^gradients/Layer1/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer1/MatMul_grad/MatMul_1"
      }
    }
  }
}
node {
  name: "gradients/AddN_1"
  op: "AddN"
  input: "gradients/Layer1/weights/Regularizer/l2_regularizer/L2Loss_grad/mul"
  input: "gradients/Layer1/MatMul_grad/tuple/control_dependency_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/Layer1/weights/Regularizer/l2_regularizer/L2Loss_grad/mul"
      }
    }
  }
}
node {
  name: "GradientDescent/learning_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "GradientDescent/update_Layer1/weights/ApplyGradientDescent"
  op: "ApplyGradientDescent"
  input: "Layer1/weights"
  input: "GradientDescent/learning_rate"
  input: "gradients/AddN_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "GradientDescent/update_Layer1/biases/ApplyGradientDescent"
  op: "ApplyGradientDescent"
  input: "Layer1/biases"
  input: "GradientDescent/learning_rate"
  input: "gradients/Layer1/add_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "GradientDescent/update_Layer2/weights/ApplyGradientDescent"
  op: "ApplyGradientDescent"
  input: "Layer2/weights"
  input: "GradientDescent/learning_rate"
  input: "gradients/AddN"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer2/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "GradientDescent/update_Layer2/biases/ApplyGradientDescent"
  op: "ApplyGradientDescent"
